app/Controllers/Home.php

SELECT `articulos`.*, `precios`.`pventa` as `precio`
FROM `articulos`
JOIN `precios` ON `precios`.`codart`=`articulos`.`id`
WHERE `articulos`.`oferta` = 1
SELECT `articulos`.*, `precios`.`pventa` as `precio`
FROM `articulos`
JOIN `precios` ON `precios`.`codart`=`articulos`.`id`
WHERE `articulos`.`destaca` = 1
---
    public function index(): string
    {

        $ArticulosModel = new ArticulosModel();

        $result = $ArticulosModel->join("precios", "precios.codart=articulos.id")
            ->select("articulos.*, precios.pventa as precio")
            ->where("articulos.oferta", 1)
            ->findAll();

        $desta = $ArticulosModel->join("precios", "precios.codart=articulos.id")
            ->select("articulos.*, precios.pventa as precio")
            ->where("articulos.destaca", 1)
            ->findAll();

SELECT `articulos`.*, `precios`.`pventa` as `precio`
FROM `articulos`
JOIN `precios` ON `precios`.`codart`=`articulos`.`id`
WHERE `articulos`.`oferta` = 1
AND `articulos`.`catesub` = 1701
---
    public function baterias(): string
    {
        $ArticulosModel = new ArticulosModel();
        $result = $ArticulosModel->join("precios", "precios.codart=articulos.id")
            ->select("articulos.*, precios.pventa as precio")
            ->where("articulos.oferta", 1)
            ->where("articulos.catesub", 1701)
            ->findAll();